Repository: n0rb92/norbert_cholody_cv
Catalog: lib/l10n/app_*.arb
Languages: pl

# emailCopied
source: E-mail address copied to the clipboard.
pl: Adres e-mail skopiowany do schowka.

# themeChange
source: Change theme
pl: Zmień motyw

source: My skills
pl: Moje umiejętności

source: My Github
pl: Mój Github

# myGooglePlay
source: My Google Play apps
pl: Moje aplikacje w Google Play

source: Back
pl: Wróć

# myHistory
source: My Story with Flutter
pl: Moja Historia z Flutter

# himyNameIs
source: Hi, my name is Norbert Cholody.
pl: Cześć, nazywam się Norbert Chołody.

# wantToTellYou
source: I want to tell you about my still short but intense adventure with programming in Flutter.
pl: Chcę ci opowiedzieć moją jeszcze krótką ale intensywną przygodę z programowaniem we Flutter.

# paragraph1
source: My adventure with programming in Flutter began in December 2022, when I came across Adam Smaki's Facebook ad. Encouraged by the opportunity to create my own mobile applications, I decided to attend a webinar. Flutter's presentation made a huge impression on me, prompting me to start learning from January 2023. The process was a source of great satisfaction for me, and I developed my skills not only through Adam's course, but also by using "Flutter Mapp" and "Flutter Athletes Poland" materials.
pl: Moja przygoda z programowaniem we Flutterze rozpoczęła się w grudniu 2022 roku, kiedy natknąłem się na reklamę Adama Smaki na Facebooku. Zachęcony możliwością tworzenia własnych aplikacji mobilnych, postanowiłem wziąć udział w webinarze. Prezentacja Fluttera zrobiła na mnie ogromne wrażenie, co skłoniło mnie do rozpoczęcia nauki od stycznia 2023 roku. Proces ten był dla mnie źródłem ogromnej satysfakcji, a swoje umiejętności rozwijałem nie tylko poprzez kurs Adama, ale również korzystając z materiałów "Flutter Mapp" i "Flutter Athletes Polska".

# paragraph2
source: In July 2023, after six months of intensive study, I started working on my first application - "Model Maniacs". It is a tool created for collectors of Hot Wheels and Matchbox model cars, which I collect myself. The app, available in the Play store, is available in 7 languages and uses Firebase. Since its release on August 29, the app has received five updates, earning praise from users.
pl: W lipcu 2023 roku, po sześciu miesiącach intensywnej nauki, rozpocząłem pracę nad swoją pierwszą aplikacją - "Model Maniacs". Jest to narzędzie stworzone z myślą o kolekcjonerach modeli samochodów Hot Wheels i Matchbox, które sam zbieram. Aplikacja, dostępna w sklepie Play, jest dostępna w 7 językach i wykorzystuje Firebase. Od czasu premiery 25 sierpnia, aplikacja otrzymała pięć aktualizacji, zdobywając uznanie użytkowników.

# paragraph3
source: I then took on a project that had been on my mind for a long time - an app for 3D printer users. I've been running a small company specializing in 3D printing since 2021, which inspired me to create a tool to manage my filament inventory, printer database and print history, including filament consumption. The result of two months of work became the ALNO 3D Filaments Warehouse application, also based on Firebase and managed with Bloc Cubit.
pl: Następnie zająłem się projektem, który od dawna chodził mi po głowie - aplikacją dla użytkowników drukarek 3D. Od 2021 roku prowadzę małą firmę specjalizującą się w druku 3D, co zainspirowało mnie do stworzenia narzędzia do zarządzania zapasami filamentu, bazą danych drukarek i historią wydruków, w tym zużyciem filamentu. Efektem dwóch miesięcy pracy stała się aplikacja ALNO 3D Filaments Warehouse, również oparta na Firebase i zarządzana za pomocą Bloc Cubit.

# paragraph4
source: I am currently working on a third application and at the same time looking for employment opportunities as a Flutter developer. My goal is to learn from professionals every day and participate in commercial projects.
pl: Obecnie pracuję nad trzecią aplikacją i jednocześnie szukam możliwości zatrudnienia jako programista Fluttera. Moim marzeniem, jest codzienna nauka od profesjonalistów i udział w komercyjnych projektach.

# alno3D
source: ALNO 3D is a 3D printing company and also under this brand I have released both my applications.
pl: ALNO 3D to firma zajmująca się drukiem 3D a także pod tą marką wydałem obie swoje aplikacje.

source: API implementation:
pl: Implementacja API:

source: Your location:
pl: Twoja lokalizacja:

# weatherWidget
source: Enter City Name, to know actually weather
pl: Wpisz nazwę miasta aby poznać aktualną pogodę.

# temp
source: Temperature:
pl: Temperatura:

# prec
source: Precipitation:
pl: Opady:

# hum
source: Humidity:
pl: Wilgotność:

# press
source: Pressure:
pl: Ciśnienie atmosferyczne:

source: Wind:
pl: Wiatr:

# footer
source: Made in proud with Flutter
pl: Stworzony z dumą we Flutter
